controllers/ProductsRenderController.php

    public function actionDeleteAll()
    {
        ProductsRender::deleteAll();
---
DELETE FROM `products_render`