controllers/ProductsController.php

UPDATE `products` SET `parsed`=0 WHERE `id`=5201
SELECT COUNT(*) FROM `products` WHERE `id` IN ('5227', '5225', '5226', '5222', '5223', '5221', '5219', '5220', '5218', '5217', '5215', '5214', '5212', '5211', '5209', '5210', '5208', '5206', '5207', '5205', '5203', '5204', '5201', '5202', '5224', '5216', '5213')
---
    public function actionSetMany($attr, $value)
    {

        $session = Yii::$app->session;
        $ids = $session->get('ids');
        $query = Products::find()->where(['in', 'id', $ids]);
        $products = $query->all();
        foreach ($products as $product) {
            $product[$attr] = $value;
            $product->save();
        }

        return $query->count();