views/products-render/_stats.php

SELECT DISTINCT `category` FROM `products_render`
---
    <div class="tab-content">
        <div role="tabpanel" class="tab-pane active" id="home">
            <?php
            $categories = \app\models\ProductsRender::find()->select('category')->distinct()->column(); ?>

SELECT COUNT(*) FROM `products_render` WHERE `category` LIKE '%ТРЕНИРОВОЧНАЯ ОДЕЖДА%'
---
                <?php foreach ($categories as $category) { ?>
                    <tr>
                        <td> <?php echo $category; ?></td>
                        <td><? echo \app\models\ProductsRender::find()->where(['like', 'category', $category])->count(); ?></td>

SELECT COUNT(*) FROM `products_render` WHERE (`category`='') OR (`category` IS NULL)
---
                <?php } ?>
                <tr>
                    <td> <?php echo "<b>БЕЗ КАТЕГОРИИ</b>"; ?></td>
                    <td><? echo \app\models\ProductsRender::find()->where(['OR',
                            ['category' => ''],
                            ['IS', 'category', NULL],
                        ])->count(); ?>