models/MainCategoriesQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `main_categories`