models/Processing.php

            // D::echor("<br>pq_page " . $pq_page);

            if (!$options['not_save']) {
                if (!$product->save()) D::dump($product->getErrors());
---
UPDATE `products` SET `time`=1526933310, `price_old`='1450', `parsed`=1 WHERE `id`=3627